Revit 2027 API
ConicalSurface.Origin Property
 Apex of the cone. This is the origin of the local coordinate system associated with this cone.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Origin { get; }
Public ReadOnly Property Origin As XYZ
	Get
public:
property XYZ^ Origin {
	XYZ^ get ();
}
member Origin : XYZ with get
Property Value
XYZ
See Also
Reference
ConicalSurface Class
Autodesk.Revit.DB Namespace